kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.h
/* Copyright 2018 Canaan Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#ifndef _DRIVER_DMAC_H
#define _DRIVER_DMAC_H

#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

#include "k210_bsp.h"

#include "k210_io.h"
#include "k210_plic.h"

#ifdef __cplusplus
extern "C" {
#endif

/* DMAC */
#define DMAC_CHANNEL_COUNT (DMAC_CHANNEL_MAX)
#define LAST_ROW (-1)

typedef enum _dmac_channel_number
{
    DMAC_CHANNEL0 = 0,
    DMAC_CHANNEL1 = 1,
    DMAC_CHANNEL2 = 2,
    DMAC_CHANNEL3 = 3,
    DMAC_CHANNEL4 = 4,
    DMAC_CHANNEL5 = 5,
    DMAC_CHANNEL_MAX
} dmac_channel_number_t;

typedef enum _dmac_src_dst_select
{
    DMAC_SRC = 0x1,
    DMAC_DST = 0x2,
    DMAC_SRC_DST = 0x3
} dmac_src_dst_select_t;

typedef enum _state_value
{
    clear = 0,
    set = 1
} state_value_t;

typedef enum _dmac_lock_bus_ch
{
    DMAC_LOCK_BUS = 0x1,
    DMAC_LOCK_CHANNEL = 0x2,
    DMAC_LOCK_BUS_CH = 0x3
} dmac_lock_bus_ch_t;

typedef enum _dmac_sw_hw_hs_select
{
    DMAC_HS_HARDWARE = 0x0,
    DMAC_HS_SOFTWARE = 0x1
} dmac_sw_hw_hs_select_t;

typedef enum _dmac_scatter_gather_param
{
    DMAC_SG_COUNT = 0x0,
    DMAC_SG_INTERVAL = 0x1
} dmac_scatter_gather_param_t;

typedef enum _dmac_irq
{
    /* no interrupts */
    DMAC_IRQ_NONE = 0x00,
    /* transfer complete */
    DMAC_IRQ_TFR = 0x01,
    /* block transfer complete */
    DMAC_IRQ_BLOCK = 0x02,
    /* source transaction complete */
    DMAC_IRQ_SRCTRAN = 0x04,
    /* destination transaction complete */
    DMAC_IRQ_DSTTRAN = 0x08,
    /* error */
    DMAC_IRQ_ERR = 0x10,
    /* all interrupts */
    DMAC_IRQ_ALL = 0x1f
} dmac_irq_t;

typedef enum _dmac_software_req
{
    /* ReqSrcReq/ReqDstReq */
    DMAC_REQUEST = 0x1,
    /* SglReqSrcReq/SglReqDstReq */
    DMAC_SINGLE_REQUEST = 0x2,
    /* LstReqSrcReq/LstReqDstReq */
    DMAC_LAST_REQUEST = 0x4
} dmac_software_req_t;

typedef enum _dmac_master_number
{
    DMAC_MASTER1 = 0x0,
    DMAC_MASTER2 = 0x1
} dmac_master_number_t;

typedef enum _dmac_transfer_flow
{
    /* mem to mem - DMAC   flow ctlr */
    DMAC_MEM2MEM_DMA = 0x0,
    /* mem to prf - DMAC   flow ctlr */
    DMAC_MEM2PRF_DMA = 0x1,
    /* prf to mem - DMAC   flow ctlr */
    DMAC_PRF2MEM_DMA = 0x2,
    /* prf to prf - DMAC   flow ctlr */
    DMAC_PRF2PRF_DMA = 0x3,
    /* prf to mem - periph flow ctlr */
    DMAC_PRF2MEM_PRF = 0x4,
    /* prf to prf - source flow ctlr */
    DMAC_PRF2PRF_SRCPRF = 0x5,
    /* mem to prf - periph flow ctlr */
    DMAC_MEM2PRF_PRF = 0x6,
    /* prf to prf - dest   flow ctlr */
    DMAC_PRF2PRF_DSTPRF = 0x7
} dmac_transfer_flow_t;

typedef enum _dmac_burst_trans_length
{
    DMAC_MSIZE_1 = 0x0,
    DMAC_MSIZE_4 = 0x1,
    DMAC_MSIZE_8 = 0x2,
    DMAC_MSIZE_16 = 0x3,
    DMAC_MSIZE_32 = 0x4,
    DMAC_MSIZE_64 = 0x5,
    DMAC_MSIZE_128 = 0x6,
    DMAC_MSIZE_256 = 0x7
} dmac_burst_trans_length_t;

typedef enum _dmac_address_increment
{
    DMAC_ADDR_INCREMENT = 0x0,
    DMAC_ADDR_NOCHANGE = 0x1
} dmac_address_increment_t;

typedef enum _dmac_transfer_width
{
    DMAC_TRANS_WIDTH_8 = 0x0,
    DMAC_TRANS_WIDTH_16 = 0x1,
    DMAC_TRANS_WIDTH_32 = 0x2,
    DMAC_TRANS_WIDTH_64 = 0x3,
    DMAC_TRANS_WIDTH_128 = 0x4,
    DMAC_TRANS_WIDTH_256 = 0x5
} dmac_transfer_width_t;

typedef enum _dmac_hs_interface
{
    DMAC_HS_IF0 = 0x0,
    DMAC_HS_IF1 = 0x1,
    DMAC_HS_IF2 = 0x2,
    DMAC_HS_IF3 = 0x3,
    DMAC_HS_IF4 = 0x4,
    DMAC_HS_IF5 = 0x5,
    DMAC_HS_IF6 = 0x6,
    DMAC_HS_IF7 = 0x7,
    DMAC_HS_IF8 = 0x8,
    DMAC_HS_IF9 = 0x9,
    DMAC_HS_IF10 = 0xa,
    DMAC_HS_IF11 = 0xb,
    DMAC_HS_IF12 = 0xc,
    DMAC_HS_IF13 = 0xd,
    DMAC_HS_IF14 = 0xe,
    DMAC_HS_IF15 = 0xf
} dmac_hs_interface_t;

typedef enum _dmac_multiblk_transfer_type
{
    CONTIGUOUS = 0,
    RELOAD = 1,
    SHADOWREGISTER = 2,
    LINKEDLIST = 3
} dmac_multiblk_transfer_type_t;

typedef enum _dmac_multiblk_type
{
    DMAC_SRC_DST_CONTINUE = 0,
    DMAC_SRC_CONTINUE_DST_RELAOD = 2,
    DMAC_SRC_CONTINUE_DST_LINKEDLIST = 3,
    DMAC_SRC_RELOAD_DST_CONTINUE = 4,
    DMAC_SRC_RELOAD_DST_RELOAD = 5,
    DMAC_SRC_RELOAD_DST_LINKEDLIST = 6,
    DMAC_SRC_LINKEDLIST_DST_CONTINUE = 7,
    DMAC_SRC_LINKEDLIST_DST_RELOAD = 8,
    DMAC_SRC_LINKEDLIST_DST_LINKEDLIST = 9,
    DMAC_SRC_SHADOWREG_DST_CONTINUE = 10
} dmac_multiblk_type_t;

typedef enum _dmac_transfer_type
{
    DMAC_TRANSFER_ROW1 = 0x1,
    DMAC_TRANSFER_ROW2 = 0x2,
    DMAC_TRANSFER_ROW3 = 0x3,
    DMAC_TRANSFER_ROW4 = 0x4,
    DMAC_TRANSFER_ROW5 = 0x5,
    DMAC_TRANSFER_ROW6 = 0x6,
    DMAC_TRANSFER_ROW7 = 0x7,
    DMAC_TRANSFER_ROW8 = 0x8,
    DMAC_TRANSFER_ROW9 = 0x9,
    DMAC_TRANSFER_ROW10 = 0xa
} dmac_transfer_type_t;

typedef enum _dmac_prot_level
{
    /* default prot level */
    DMAC_NONCACHE_NONBUFF_NONPRIV_OPCODE = 0x0,
    DMAC_NONCACHE_NONBUFF_NONPRIV_DATA = 0x1,
    DMAC_NONCACHE_NONBUFF_PRIV_OPCODE = 0x2,
    DMAC_NONCACHE_NONBUFF_PRIV_DATA = 0x3,
    DMAC_NONCACHE_BUFF_NONPRIV_OPCODE = 0x4,
    DMAC_NONCACHE_BUFF_NONPRIV_DATA = 0x5,
    DMAC_NONCACHE_BUFF_PRIV_OPCODE = 0x6,
    DMAC_NONCACHE_BUFF_PRIV_DATA = 0x7,
    DMAC_CACHE_NONBUFF_NONPRIV_OPCODE = 0x8,
    DMAC_CACHE_NONBUFF_NONPRIV_DATA = 0x9,
    DMAC_CACHE_NONBUFF_PRIV_OPCODE = 0xa,
    DMAC_CACHE_NONBUFF_PRIV_DATA = 0xb,
    DMAC_CACHE_BUFF_NONPRIV_OPCODE = 0xc,
    DMAC_CACHE_BUFF_NONPRIV_DATA = 0xd,
    DMAC_CACHE_BUFF_PRIV_OPCODE = 0xe,
    DMAC_CACHE_BUFF_PRIV_DATA = 0xf
} dmac_prot_level_t;

typedef enum _dmac_fifo_mode
{
    DMAC_FIFO_MODE_SINGLE = 0x0,
    DMAC_FIFO_MODE_HALF = 0x1
} dmac_fifo_mode_t;

