kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.h
typedef enum _dw_dmac_flow_ctl_mode
{
    DMAC_DATA_PREFETCH_ENABLED = 0x0,
    DMAC_DATA_PREFETCH_DISABLED = 0x1
} dw_dmac_flow_ctl_mode_t;

typedef enum _dmac_polarity_level
{
    DMAC_ACTIVE_HIGH = 0x0,
    DMAC_ACTIVE_LOW = 0x1
} dmac_polarity_level_t;

typedef enum _dmac_lock_level
{
    DMAC_LOCK_LEVEL_DMA_TRANSFER = 0x0,
    DMAC_LOCK_LEVEL_BLOCK_TRANSFER = 0x1,
    DMAC_LOCK_LEVEL_TRANSACTION = 0x2
} dmac_lock_level_t;

typedef enum _dmac_channel_priority
{
    DMAC_PRIORITY_0 = 0x0,
    DMAC_PRIORITY_1 = 0x1,
    DMAC_PRIORITY_2 = 0x2,
    DMAC_PRIORITY_3 = 0x3,
    DMAC_PRIORITY_4 = 0x4,
    DMAC_PRIORITY_5 = 0x5,
    DMAC_PRIORITY_6 = 0x6,
    DMAC_PRIORITY_7 = 0x7
} dmac_channel_priority_t;

typedef enum _dmac_state
{
    ZERO,
    ONE
} dmac_state_t;

typedef enum _dmac_common_int
{
    SLVIF_COMMON_DEC_ERR = 0,
    SLVIF_COMMON_WR2RO_ERR = 1,
    SLVIF_COMMON_RD2WO_ERR = 2,
    SLVIF_COMMON__WRONHOLD_ERR = 3,
    SLVIF_UNDEFINED_DEC_ERR = 4,
    SLVIF_ALL_INT = 5
} dmac_common_int_t;

typedef struct _dmac_cfg
{
    /**
     * Bit 0 is used to enable dmac
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t dmac_en : 1;
    /**
     * Bit 1 is used to glabally enable interrupt generation
     * 0x1 for enable interrupt, 0x0 for disable interrupt
     */
    uint64_t int_en : 1;
    /* Bits [63:2] is reserved */
    uint64_t rsvd : 62;
} __attribute__((packed, aligned(8))) dmac_cfg_t;

typedef union _dmac_cfg_u
{
    dmac_cfg_t cfg;
    uint64_t data;
} dmac_cfg_u_t;

typedef struct _damc_chen
{
    /**
     * Bit 0 is used to enable channel 1
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch1_en : 1;
    /**
     * Bit 1 is used to enable channel 2
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch2_en : 1;
    /**
     * Bit 2 is used to enable channel 3
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch3_en : 1;
    /**
     * Bit 3 is used to enable channel 4
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch4_en : 1;
    /**
     * Bit 4 is used to enable channel 5
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch5_en : 1;
    /**
     * Bit 5 is used to enable channel 6
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch6_en : 1;
    /* Bits [7:6] is reserved */
    uint64_t rsvd1 : 2;
    /**
     * Bit 8 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch1_en_we : 1;
    /**
     * Bit 9 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch2_en_we : 1;
    /**
     * Bit 10 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch3_en_we : 1;
    /**
     * Bit 11 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch4_en_we : 1;
    /**
     * Bit 12 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch5_en_we : 1;
    /**
     * Bit 13 is write enable bit
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t ch6_en_we : 1;
    /* Bits [15:14] is reserved */
    uint64_t rsvd2 : 2;
    /**
     * Bit 16 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch1_susp : 1;
    /**
     * Bit 17 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch2_susp : 1;
    /* Bit 18 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch3_susp : 1;
    /**
     * Bit 19 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch4_susp : 1;
    /**
     * Bit 20 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch5_susp : 1;
    /**
     * Bit 21 is susped reuest
     * 0x1 for request channel suspend
     * 0x0 for no channel suspend request
     */
    uint64_t ch6_susp : 1;
    /* Bits [23:22] is reserved */
    uint64_t rsvd3 : 2;
    /**
     * Bit  24 is write enable to the channel suspend bit
     * 0x1 for enable write to CH1_SUSP bit
     * 0x0 for disable write to CH1_SUSP bit
     */
    uint64_t ch1_susp_we : 1;
    /**
     * Bit  25 is write enable to the channel suspend bit
     * 0x1 for enable write to CH2_SUSP bit
     * 0x0 for disable write to CH2_SUSP bit
     */
    uint64_t ch2_susp_we : 1;
    /**
     * Bit  26 is write enable to the channel suspend bit
     * 0x1 for enable write to CH3_SUSP bit
     * 0x0 for disable write to CH3_SUSP bit
     */
    uint64_t ch3_susp_we : 1;
    /**
     * Bit  27 is write enable to the channel suspend bit
     * 0x1 for enable write to CH4_SUSP bit
     * 0x0 for disable write to CH4_SUSP bit
     */
    uint64_t ch4_susp_we : 1;
    /**
     * Bit  28 is write enable to the channel suspend bit
     * 0x1 for enable write to CH5_SUSP bit
     * 0x0 for disable write to CH5_SUSP bit
     */
    uint64_t ch5_susp_we : 1;
    /**
     * Bit  29 is write enable to the channel suspend bit
     * 0x1 for enable write to CH6_SUSP bit
     * 0x0 for disable write to CH6_SUSP bit
     */
    uint64_t ch6_susp_we : 1;
    /* Bits [31:30] is reserved */
    uint64_t rsvd4 : 2;
    /**
     * Bit  32 is channel-1 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch1_abort : 1;
    /**
     * Bit  33 is channel-2 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch2_abort : 1;
    /**
     * Bit  34 is channel-3 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch3_abort : 1;
    /**
     * Bit  35 is channel-4 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch4_abort : 1;
    /**
     * Bit  36 is channel-5 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch5_abort : 1;
    /**
     * Bit  37 is channel-6 abort requst bit
     * 0x1 for request for channnel abort
     * 0x0 for no channel abort request
     */
    uint64_t ch6_abort : 1;
    /* Bits [39:38] is reserved */
    uint64_t rsvd5 : 2;
    /**
     * Bit 40 is ued to write enable  channel-1 abort bit
     * 0x1 for enable write to CH1_ABORT bit
     * 0x0 for disable write to CH1_ABORT bit
     */
    uint64_t ch1_abort_we : 1;
    /**
     * Bit 41 is ued to write enable  channel-2 abort bit
     * 0x1 for enable write to CH2_ABORT bit
     * 0x0 for disable write to CH2_ABORT bit
     */
    uint64_t ch2_abort_we : 1;
    /**
     * Bit 42 is ued to write enable  channel-3 abort bit
     * 0x1 for enable write to CH3_ABORT bit
     * 0x0 for disable write to CH3_ABORT bit
     */
    uint64_t ch3_abort_we : 1;
    /**
     * Bit 43 is ued to write enable  channel-4 abort bit
     * 0x1 for enable write to CH4_ABORT bit
     * 0x0 for disable write to CH4_ABORT bit
     */
    uint64_t ch4_abort_we : 1;
    /**
     * Bit 44 is ued to write enable  channel-5 abort bit
     * 0x1 for enable write to CH5_ABORT bit
     * 0x0 for disable write to CH5_ABORT bit
     */
    uint64_t ch5_abort_we : 1;
    /**
     * Bit 45 is ued to write enable  channel-6 abort bit
     * 0x1 for enable write to CH6_ABORT bit
     * 0x0 for disable write to CH6_ABORT bit
     */
    uint64_t ch6_abort_we : 1;
    /* Bits [47:46] is reserved */
    uint64_t rsvd6 : 2;
    /* Bits [63:48] is reserved */
    uint64_t rsvd7 : 16;
} __attribute__((packed, aligned(8))) damc_chen_t;

