kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.h
typedef union _dmac_chen_u
{
    damc_chen_t dmac_chen;
    uint64_t data;
} dmac_chen_u_t;

typedef struct _dmac_intstatus
{
    /**
     * Bit 0 is channel 1 interrupt bit
     * 0x1 for channel 1 interrupt  active
     * 0x0 for channel 1 interrupt inactive
     */
    uint64_t ch1_intstat : 1;
    /**
     * Bit 1 is channel 1 interrupt bit
     * 0x1 for channel 2 interrupt  active
     * 0x0 for channel 2 interrupt inactive
     */
    uint64_t ch2_intstat : 1;
    /**
     * Bit 2 is channel 3 interrupt bit
     * 0x1 for channel 3 interrupt  active
     * 0x0 for channel 3 interrupt inactive
     */
    uint64_t ch3_intstat : 1;
    /**
     * Bit 3 is channel 4 interrupt bit
     * 0x1 for channel 4 interrupt  active
     * 0x0 for channel 4 interrupt inactive
     */
    uint64_t ch4_intstat : 1;
    /**
     * Bit 4 is channel 5 interrupt bit
     * 0x1 for channel 5 interrupt  active
     * 0x0 for channel 5 interrupt inactive
     */
    uint64_t ch5_intstat : 1;
    /**
     * Bit 5 is channel 6 interrupt bit
     * 0x1 for channel 6 interrupt  active
     * 0x0 for channel 6 interrupt inactive
     */
    uint64_t ch6_intstat : 1;
    /* Bits [15:6] is reserved */
    uint64_t rsvd1 : 10;
    /**
     * Bit 16 is commom register status bit
     * 0x1 for common register interrupt is active
     * 0x0 for common register interrupt inactive
     */
    uint64_t commonreg_intstat : 1;
    /* Bits [63:17] is reserved */
    uint64_t rsvd2 : 47;
} __attribute__((packed, aligned(8))) dmac_intstatus_t;

typedef union _dmac_intstatus_u
{
    dmac_intstatus_t intstatus;
    uint64_t data;
} dmac_intstatus_u_t;

typedef struct _dmac_commonreg_intclear
{
    /**
     * Bit 0 is slave nterface Common Register
     * Decode Error Interrupt clear Bit
     * x01 for clear SLVIF_CommonReg_DEC_ERR interrupt
     * in DMAC_COMMONREG_INTSTATUSREG
     * 0x0 for inactive signal
     */
    uint64_t cear_slvif_dec_err_intstat : 1;
    /**
     * Bit 1 is Slave Interface Common Register Write
     * to Read only Error Interrupt clear Bit
     * x01 for clear SLVIF_CommonReg_WR2RO_ERR interrupt
     * in DMAC_COMMONREG_INTSTATUSREG
     * 0x0 for inactive signal
     */
    uint64_t clear_slvif_wr2ro_err_intstat : 1;
    /**
     * Bit 2 is Slave Interface Common Register Read to
     * Write only Error Interrupt clear Bit
     * x01 for clear SLVIF_CommonReg_RD2WO_ERR  interrupt
     * in DMAC_COMMONREG_INTSTATUSREG
     * 0x0 for inactive signal
     */
    uint64_t clear_slvif_rd2wo_err_intstat : 1;
    /**
     * Bit 3 is Slave Interface Common Register Write
     * On Hold Error Interrupt clear Bit
     * x01 for clear SSLVIF_CommonReg_WrOnHold_ERR interrupt
     * in DMAC_COMMONREG_INTSTATUSREG
     * 0x0 for inactive signal
     */
    uint64_t clear_slvif_wronhold_err_intstat : 1;
    /* Bits [7:4] is reserved */
    uint64_t rsvd1 : 4;
    /**
     * Bit 8 is Slave Interface Undefined register
     * Decode Error Interrupt clear Bit
     * x01 for clear SLVIF_UndefinedReg_DEC_ERRinterrupt
     * in DMAC_COMMONREG_INTSTATUSREG
     * 0x0 for inactive signal
     */
    uint64_t clear_slvif_undefinedreg_dec_err_intstat : 1;
    /* Bits [63:9] is reserved */
    uint64_t rsvd2 : 55;
} __attribute__((packed, aligned(8))) dmac_commonreg_intclear_t;

typedef union _dmac_commonreg_intclear_u
{
    dmac_commonreg_intclear_t com_intclear;
    uint64_t data;
} dmac_commonreg_intclear_u_t;

typedef struct _dmac_commonreg_intstatus_enable
{
    /**
     * Bit 0 is Slave Interface Common Register Decode Error
     * Interrupt Status Enable Bit
     * 0x1 for SLVIF_CommonReg_DEC_ERR_IntStat bit enable
     * 0x0 for SLVIF_CommonReg_DEC_ERR_IntStat bit disable
     */
    uint64_t enable_slvif_dec_err_intstat : 1;
    /**
     * Bit 1 is Slave Interface Common Register Write to Read
     * only Error Interrupt Status Enable Bit
     * 0x1 for SLVIF_CommonReg_WR2RO_ERR_IntStat bit enable
     * 0x0 for SLVIF_CommonReg_WR2RO_ERR_IntStat bit disable
     */
    uint64_t enable_slvif_wr2ro_err_intstat : 1;
    /*!<
     * Bit 2 is Slave Interface Common Register Read to Write
     * only Error Interrupt Status Enable Bit
     * 0x1 for SLVIF_CommonReg_RD2WO_ERR_IntStat bit enable
     * 0x0 for SLVIF_CommonReg_RD2WO_ERR_IntStat bit disable
     */
    uint64_t enable_slvif_rd2wo_err_intstat : 1;
    /**
     * Bit 3 is Slave Interface Common Register Write On Hold
     * Error Interrupt Status Enable Bit
     * 0x1 for SLVIF_CommonReg_WrOnHold_ERR_IntStat bit enable
     * 0x0 for SLVIF_CommonReg_WrOnHold_ERR_IntStat bit disable
     */
    uint64_t enable_slvif_wronhold_err_intstat : 1;
    /* Bits [7:4] is reserved */
    uint64_t rsvd1 : 4;
    /**
     * Bit 8 is Slave Interface Undefined register Decode
     * Error Interrupt Status enable Bit
     * 0x1 for SLVIF_UndefinedReg_DEC_ERR_IntStat bit enable
     * 0x0 for SLVIF_UndefinedReg_DEC_ERR_IntStat disable
     */
    uint64_t enable_slvif_undefinedreg_dec_err_intstat : 1;
    /* Bits [63:9] is reserved */
    uint64_t rsvd2 : 55;
} __attribute__((packed, aligned(8))) dmac_commonreg_intstatus_enable_t;

typedef union _dmac_commonreg_intstatus_enable_u
{
    dmac_commonreg_intstatus_enable_t intstatus_enable;
    uint64_t data;
} dmac_commonreg_intstatus_enable_u_t;

typedef struct _dmac_commonreg_intsignal_enable
{
    /**
     * Bit 0 is Slave Interface Common Register Decode Error
     * Interrupt Signal Enable Bit
     * 0x1 for SLVIF_CommonReg_DEC_ERR_IntStat signal enable
     * 0x0 for SLVIF_CommonReg_DEC_ERR_IntStat signal disable
     */
    uint64_t enable_slvif_dec_err_intsignal : 1;
    /**
     * Bit 1 is Slave Interface Common Register Write to Read only
     *  Error Interrupt Signal Enable Bit
     * 0x1 for SLVIF_CommonReg_WR2RO_ERR_IntStat signal enable
     * 0x0 for SLVIF_CommonReg_WR2RO_ERR_IntStat signal disable
     */
    uint64_t enable_slvif_wr2ro_err_intsignal : 1;
    /**
     * Bit 2 is Slave Interface Common Register Read to
     *  Write only Error Interrupt Status Enable Bit
     * 0x1 for SLVIF_CommonReg_RD2WO_ERR_IntStat bit enable
     * 0x0 for SLVIF_CommonReg_RD2WO_ERR_IntStat bit disable
     */
    uint64_t enable_slvif_rd2wo_err_intsignal : 1;
    /**
     * Bit 3 is Slave Interface Common Register Write On Hold Error
     * Interrupt Signal Enable Bit
     * 0x1 for SLVIF_CommonReg_WrOnHold_ERR_IntStat signal enable
     * 0x0 for SLVIF_CommonReg_WrOnHold_ERR_IntStat signal disable
     */
    uint64_t enable_slvif_wronhold_err_intsignal : 1;
    /* Bits [7:4] is reserved */
    uint64_t rsvd1 : 4;
    /**
     * Bit 8 is Slave Interface Undefined register Decode Error
     * Interrupt Signal Enable Bit
     * 0x1 for SLVIF_UndefinedReg_DEC_ERR_IntStat signal enable
     * 0x0 for SLVIF_UndefinedReg_DEC_ERR_IntStat signal disable
     */
    uint64_t enable_slvif_undefinedreg_dec_err_intsignal : 1;
    /* Bits [63:9] is reserved */
    uint64_t rsvd2 : 55;
} __attribute__((packed, aligned(8))) dmac_commonreg_intsignal_enable_t;

typedef union _dmac_commonreg_intsignal_enable_u
{
    dmac_commonreg_intsignal_enable_t intsignal_enable;
    uint64_t data;
} dmac_commonreg_intsignal_enable_u_t;

typedef struct _dmac_commonreg_intstatus
{
    /**
     * Bit 0 is Slave Interface Common Register Decode
     * Error Interrupt Status Bit
     * 0x1 for Slave Interface Decode Error detected
     * 0x0 for No Slave Interface Decode Errors
     */
    uint64_t slvif_dec_err_intstat : 1;
    /**
     * Bit 1 is Slave Interface Common Register Write to Read Only
     * Error Interrupt Status bit
     * 0x1 for Slave Interface Write to Read Only Error detected
     * 0x0 No Slave Interface Write to Read Only Errors
     */
    uint64_t slvif_wr2ro_err_intstat : 1;
    /**
     * Bit 2 is Slave Interface Common Register Read to Write
     * only Error Interrupt Status bit
     * 0x1 for Slave Interface Read to Write Only Error detected
     * 0x0 for No Slave Interface Read to Write Only Errors
     */
    uint64_t slvif_rd2wo_err_intstat : 1;
    /**
     * Bit 3 is Slave Interface Common Register Write On
     * Hold Error Interrupt Status Bit
     * 0x1 for Slave Interface Common Register Write On Hold Error detected
     * 0x0 for No Slave Interface Common Register Write On Hold Errors
     */
    uint64_t slvif_wronhold_err_intstat : 1;
    /*!< Bits [7:4] is reserved */
    uint64_t rsvd1 : 4;
    /**
     * Bit 8 is Slave Interface Undefined register Decode
     * Error Interrupt Signal Enable Bit
     * 0x1 for  Slave Interface Decode Error detected
     * 0x0 for No Slave Interface Decode Errors
     */
    uint64_t slvif_undefinedreg_dec_err_intstat : 1;
    /* Bits [63:9] is reserved */
    uint64_t rsvd2 : 55;
} __attribute__((packed, aligned(8))) dmac_commonreg_intstatus_t;

typedef union _dmac_commonreg_intstatus_u
{
    dmac_commonreg_intstatus_t commonreg_intstatus;
    uint64_t data;
} dmac_commonreg_intstatus_u_t;

typedef struct _dmac_reset
{
    /* Bit 0 is DMAC reset request bit */
    uint64_t rst : 1;
    /* Bits [63:1] is reserved */
    uint64_t rsvd : 63;
} __attribute__((packed, aligned(8))) dmac_reset_t;

typedef union _dmac_reset_u
{
    dmac_reset_t reset;
    uint64_t data;
} dmac_reset_u_t;

typedef struct _dmac_ch_block_ts
{
    uint64_t block_ts : 22;
    /*!< Bit [21:0] is block transfer size*/
    uint64_t rsvd : 42;
    /*!< Bits [63:22] is reserved */
} __attribute__((packed, aligned(8))) dmac_ch_block_ts_t;

typedef union _dmac_ch_block_ts_u
{
    dmac_ch_block_ts_t block_ts;
    uint64_t data;
} dmac_ch_block_ts_u_t;

typedef struct _dmac_ch_ctl
{
    /**
     * Bit 0 is source master select
     * 1 for AXI master 2, 0 for AXI master 1
     */
    uint64_t sms : 1;
    /* Bit 1 is reserved */
    uint64_t rsvd1 : 1;
    /**
     * Bit 2 is destination master select
     * 0x1 for AXI master 2,0x0 for AXI master 1
     */
    uint64_t dms : 1;
    /* Bit 3 is reserved */
    uint64_t rsvd2 : 1;
    /**
     * Bit 4 is source address increment
     * 0x1 for no change, 0x0 for incremnet
     */
    uint64_t sinc : 1;
    /**
     * Bit 5 is reserved
     */
    uint64_t rsvd3 : 1;
    /**
     * Bit 6 is destination address incremnet
     * 0x1 for no change, 0x0 for increment
     */
    uint64_t dinc : 1;
    /* Bit 7 is reserved*/
    uint64_t rsvd4 : 1;
    /**
     * Bits [10:8] is source transfer width
     * 0x0 for source transfer width is 8 bits
     * 0x1 for source transfer width is 16 bits
     * 0x2 for source transfer width is 32 bits
     * 0x3 for source transfer width is 64 bits
     * 0x4 for source transfer width is 128 bits
     * 0x5  for source transfer width is 256 bits
     * 0x6 for source transfer width is 512 bits
     */
    uint64_t src_tr_width : 3;
    /**
     * Bits [13:11] is detination transfer width
     * 0x0 for detination transfer width is 8 bits
     * 0x1 for detination transfer width is 16 bits
     * 0x2 for detination transfer width is 32 bits
     * 0x3 for detination transfer width is 64 bits
     * 0x4 for detination transfer width is 128 bits
     * 0x5  for detination transfer width is 256 bits
     * 0x6 for detination transfer width is 512 bits
     */
    uint64_t dst_tr_width : 3;
    /**
     * Bits [17:14] is source burst transaction length
     * 0x0 for 1 data item read from rource in the burst transaction
     * 0x1 for 4 data item read from rource in the burst transaction
     * 0x2 for 8 data item read from rource in the burst transaction
     * 0x3 for 16 data item read from rource in the burst transaction
     * 0x4 for 32 data item read from rource in the burst transaction
     * 0x5 for 64 data item read from rource in the burst transaction
     * 0x6 for 128 data item read from rource in the burst transaction
     * 0x7 for 256 data item read from rource in the burst transaction
     * 0x8 for 512 data item read from rource in the burst transaction
     * 0x9 for 1024 data item read from rource in the burst transaction
     */
    uint64_t src_msize : 4;
    /**
     * Bits [17:14] is sdestination burst transaction length
     * 0x0 for 1 data item read from rource in the burst transaction
     * 0x1 for 4 data item read from rource in the burst transaction
     * 0x2 for 8 data item read from rource in the burst transaction
     * 0x3 for 16 data item read from rource in the burst transaction
     * 0x4 for 32 data item read from rource in the burst transaction
     * 0x5 for 64 data item read from rource in the burst transaction
     * 0x6 for 128 data item read from rource in the burst transaction
     * 0x7 for 256 data item read from rource in the burst transaction
     * 0x8 for 512 data item read from rource in the burst transaction
     * 0x9 for 1024 data item read from rource in the burst transaction
     */
    uint64_t dst_msize : 4;
    /**
     * Bits [25:22] is reserved
     */
    uint64_t rsvd5 : 4;
    /*!< Bits [29:26] is reserved */
    uint64_t rsvd6 : 4;
    /**
     * Bit 30 is Non Posted Last Write Enable
     * 0x1 for posted writes may be used till the end of the block
     * 0x 0 for posted writes may be used throughout the block transfer
     */
    uint64_t nonposted_lastwrite_en : 1;
    /* Bit 31 is resrved */
    uint64_t rsvd7 : 1;
    /* Bits [34:32] is reserved*/
    uint64_t rsvd8 : 3;
    /* Bits [37:35] is reserved*/
    uint64_t rsvd9 : 3;
    /**
     * Bit 38 is source burst length enable
     * 1 for enable, 0 for disable
     */
    uint64_t arlen_en : 1;
    /* Bits [46:39] is source burst length*/
    uint64_t arlen : 8;
    /**
     * Bit 47 is destination burst length enable
     * 1 for enable, 0 for disable
     */
    uint64_t awlen_en : 1;
    /* Bits [55:48] is destination burst length */
    uint64_t awlen : 8;
    /**
     * Bit 56 is source status enable
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t src_stat_en : 1;
    /**
     * Bit 57 is destination status enable
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t dst_stat_en : 1;
    /**
     * Bit 58 is interrupt completion of block transfer
     * 0x1 for enable CHx_IntStatusReg.BLOCK_TFR_DONE_IntStat field
     * 0x0 for dsiable CHx_IntStatusReg.BLOCK_TFR_DONE_IntStat field
     */
    uint64_t ioc_blktfr : 1;
    /**
     * Bits [61:59] is reserved
     */
    uint64_t rsvd10 : 3;
    /**
     * Bit 62 is last shadow linked list item
     * 0x1 for indicate shadowreg/LLI content is the last one
     * 0x0 for indicate  shadowreg/LLI content not the last one
     */
    uint64_t shadowreg_or_lli_last : 1;
    /**
     * Bit 63 is last shadow linked list item valid
     * 0x1 for indicate shadowreg/LLI content is  valid
     * 0x0 for indicate  shadowreg/LLI content is invalid
     */
    uint64_t shadowreg_or_lli_valid : 1;
} __attribute__((packed, aligned(8))) dmac_ch_ctl_t;

typedef union _dmac_ch_ctl_u
{
    dmac_ch_ctl_t ch_ctl;
    uint64_t data;
} dmac_ch_ctl_u_t;

