kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.h
typedef struct _dmac_ch_cfg
{
    /**
     * Bit[1:0] is source multi block transfer type
     * 0x0 for continuous multiblock type
     * 0x1 for reload multiblock type
     * 0x2 for shadow register based multiblock type
     * 0x3 for linked lisr bases multiblock type
     */
    uint64_t src_multblk_type : 2;
    /**
     * Bit[3:2] is source multi block transfer type
     * 0x0 for continuous multiblock type
     * 0x1 for reload multiblock type
     * 0x2 for shadow register based multiblock type
     * 0x3 for linked lisr bases multiblock type
     */
    uint64_t dst_multblk_type : 2;
    /* Bits [31:4] is reserved*/
    uint64_t rsvd1 : 28;
    /**
     * Bits [34:32] is transfer type and flow control
     * 0x0  transfer memory to memory and flow controler is dmac
     * 0x1  transfer memory to peripheral and flow controler is dmac
     * 0x2  transfer peripheral to memory and flow controler is dmac
     * 0x3  transfer peripheral to peripheral and flow controler is dmac
     * 0x4  transfer peripheral to memory and flow controler is
     * source peripheral
     * 0x5  transfer peripheral to peripheral and flow controler
     * is source peripheral
     * 0x6  transfer memory to peripheral and flow controler is
     * destination peripheral
     * 0x7  transfer peripheral to peripheral and flow controler
     * is destination peripheral
     */
    uint64_t tt_fc : 3;
    /**
     * Bit 35 is source software or hardware handshaking select
     * 0x1 for software handshaking is used
     * 0x0 for hardware handshaking is used
     */
    uint64_t hs_sel_src : 1;
    /**
     * Bit 36 is destination software or hardware handshaking select
     *0x1 for software handshaking is used
     *0x0 for hardware handshaking is used
     */
    uint64_t hs_sel_dst : 1;
    /**
     * Bit 37 is sorce hardware handshaking interface polarity
     * 0x1 active low, 0x0 active high
     */
    uint64_t src_hwhs_pol : 1;
    /**
     * Bit 38 is destination hardware handshaking interface polarity
     * 0x1 active low, 0x0 active high
     */
    uint64_t dst_hwhs_pol : 1;
    /**
     * Bits [41:39] is assign a hardware handshaking interface
     * to source of channel x
     */
    uint64_t src_per : 4;
    /* Bit 43 is reserved*/
    uint64_t rsvd3 : 1;
    /**
     * Bits [46:44] is assign a hardware handshaking interface
     * to destination of channel x
     */
    uint64_t dst_per : 4;
    /* Bit 48 is reserved*/
    uint64_t rsvd5 : 1;
    /* Bits [51:49] is channel priority,7 is highest, 0 is lowest*/
    uint64_t ch_prior : 3;
    /**
     * Bit 52 is channel lock bit
     * 0x0 for channel is not locked, 0x1 for channel is locked
     */
    uint64_t lock_ch : 1;
    /**
     * Bits [54:53] is chnannel lock level
     * 0x0 for  duration of channel is locked for entire DMA transfer
     * 0x1 for duration of channel is locked for current block transfer
     */
    uint64_t lock_ch_l : 2;
    uint64_t src_osr_lmt : 4;
    /* Bits [58:55] is source outstanding request limit */
    uint64_t dst_osr_lmt : 4;
    /* Bits [62:59] is destination outstanding request limit */
} __attribute__((packed, aligned(8))) dmac_ch_cfg_t;

typedef union _dmac_ch_cfg_u
{
    dmac_ch_cfg_t ch_cfg;
    uint64_t data;
} dmac_ch_cfg_u_t;

typedef struct _dmac_ch_llp
{
    /**
     * Bit 0 is LLI master select
     * 0x0 for next linked list item resides on AXI madster1 interface
     * 0x1 for next linked list item resides on AXI madster2 interface
     */
    uint64_t lms : 1;
    /* Bits [5:1] is reserved */
    uint64_t rsvd1 : 5;
    /* Bits [63:6] is starting address memeory of LLI block */
    uint64_t loc : 58;
} __attribute__((packed, aligned(8))) dmac_ch_llp_t;

typedef union _dmac_ch_llp_u
{
    dmac_ch_llp_t llp;
    uint64_t data;
} dmac_ch_llp_u_t;

typedef struct _dmac_ch_status
{
    /* Bits [21:0] is completed block transfer size */
    uint64_t cmpltd_blk_size : 22;
    /* Bits [46:32] is reserved */
    uint64_t rsvd1 : 15;
    /* Bits [63:47] is reserved */
    uint64_t rsvd2 : 17;
} __attribute__((packed, aligned(8))) dmac_ch_status_t;

typedef union _dmac_ch_status_u
{
    dmac_ch_status_t status;
    uint64_t data;
} dmac_ch_status_u_t;

typedef struct _dmac_ch_swhssrc
{
    /**
     * Bit 0 is software handshake request for channel source
     * 0x1 source periphraral request for a dma transfer
     * 0x0 source peripheral is not request for a burst transfer
     */
    uint64_t swhs_req_src : 1;
    /**
     * Bit 1 is write enable bit for software handshake request
     *0x1 for enable, 0x0 for disable
     */
    uint64_t swhs_req_src_we : 1;
    /**
     * Bit 2 is software handshake single request for channel source
     * 0x1 for source peripheral requesr for a single dma transfer
     *  0x0 for source peripheral is not requesting for a single transfer
     */
    uint64_t swhs_sglreq_src : 1;
    /**
     * Bit 3 is write enable bit for software handshake
     * single request for channle source
     * 0x1 for enable write, 0x0 for disable write
     */
    uint64_t swhs_sglreq_src_we : 1;
    /**
     * Bit 4 software handshake last request for channel source
     * 0x1 for current transfer is last transfer
     * 0x0 for current transfer is not the last transfer
     */
    uint64_t swhs_lst_src : 1;
    /**
     * Bit 5 is write enable bit for software
     * handshake last request
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t swhs_lst_src_we : 1;
    /* Bits [63:6] is reserved */
    uint64_t rsvd : 58;
} __attribute__((packed, aligned(8))) dmac_ch_swhssrc_t;

typedef union _dmac_ch_swhssrc_u
{
    dmac_ch_swhssrc_t swhssrc;
    uint64_t data;
} dmac_ch_swhssrc_u_t;

typedef struct _dmac_ch_swhsdst
{
    /**
     * Bit 0 is software handshake request for channel destination
     * 0x1 destination periphraral request for a dma transfer
     * 0x0 destination peripheral is not request for a burst transfer
     */
    uint64_t swhs_req_dst : 1;
    /**
     * Bit 1 is write enable bit for software handshake request
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t swhs_req_dst_we : 1;
    /**
     * Bit 2 is software handshake single request for channel destination
     * 0x1 for destination peripheral requesr for a single dma transfer
     * 0x0 for destination peripheral is not requesting
     * for a single transfer
     */
    uint64_t swhs_sglreq_dst : 1;
    /**
     * Bit 3 is write enable bit for software handshake
     * single request for channle destination
     * 0x1 for enable write, 0x0 for disable write
     */
    uint64_t swhs_sglreq_dst_we : 1;
    /**
     * Bit 4 software handshake last request for channel dstination
     * 0x1 for current transfer is last transfer
     * 0x0 for current transfer is not the last transfer
     */
    uint64_t swhs_lst_dst : 1;
    /**
     * Bit 5 is write enable bit for software handshake last request
     * 0x1 for enable, 0x0 for disable
     */
    uint64_t swhs_lst_dst_we : 1;
    /* Bits [63:6] is reserved */
    uint64_t rsvd : 58;
} __attribute__((packed, aligned(8))) dmac_ch_swhsdst_t;

typedef union _dmac_ch_swhsdst_u
{
    dmac_ch_swhsdst_t swhsdst;
    uint64_t data;
} dmac_ch_swhsdst_u_t;

