kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_dmac.h
typedef struct _dmac_ch_blk_tfr_resumereq
{
    /**
     * Bit 0 is block transfer resume request bit
     * 0x1 for request for resuming
     * 0x0 for no request to resume
     */
    uint64_t blk_tfr_resumereq : 1;
    /* Bits [63:1] is reserved */
    uint64_t rsvd : 63;
} __attribute__((packed, aligned(8))) dmac_ch_blk_tfr_resumereq_t;

typedef union _dmac_ch_blk_tfr_resumereq_u
{
    dmac_ch_blk_tfr_resumereq_t blk_tfr_resumereq;
    uint64_t data;
} dmac_ch_blk_tfr_resumereq_u_t;

typedef struct _dmac_ch_intstatus_enable
{
    /* Bit 0 is block transfer done interrupt status enable */
    uint64_t enable_block_tfr_done_intstatus : 1;
    /* DMA transfer done interrupt status enable */
    uint64_t enable_dma_tfr_done_intstat : 1;
    /* Bit 2 reserved */
    uint64_t rsvd1 : 1;
    /* Bit 3 source transaction complete status enable */
    uint64_t enable_src_transcomp_intstat : 1;
    /* Bit 4 destination transaction complete */
    uint64_t enable_dst_transcomp_intstat : 1;
    /* Bit 5 Source Decode Error Status Enable */
    uint64_t enable_src_dec_err_intstat : 1;
    /* Bit 6 Destination Decode Error Status Enable */
    uint64_t enable_dst_dec_err_intstat : 1;
    /* Bit 7 Source Slave Error Status Enable */
    uint64_t enable_src_slv_err_intstat : 1;
    /* Bit 8 Destination Slave Error Status Enable */
    uint64_t enable_dst_slv_err_intstat : 1;
    /* Bit 9 LLI Read Decode Error Status Enable */
    uint64_t enable_lli_rd_dec_err_intstat : 1;
    /* Bit 10 LLI WRITE Decode Error Status Enable */
    uint64_t enable_lli_wr_dec_err_intstat : 1;
    /* Bit 11 LLI Read Slave Error Status Enable */
    uint64_t enable_lli_rd_slv_err_intstat : 1;
    /* Bit 12 LLI WRITE Slave Error Status Enable */
    uint64_t enable_lli_wr_slv_err_intstat : 1;
    uint64_t rsvd2 : 51;
} dmac_ch_intstatus_enable_t;

typedef union _dmac_ch_intstatus_enable_u
{
    dmac_ch_intstatus_enable_t ch_intstatus_enable;
    uint64_t data;
} dmac_ch_intstatus_enable_u_t;

typedef struct _dmac_ch_intclear
{
    /* Bit 0 block transfer done interrupt clear bit.*/
    uint64_t blk_tfr_done_intstat : 1;
    /* Bit 1 DMA transfer done interrupt clear bit */
    uint64_t dma_tfr_done_intstat : 1;
    /* Bit 2 is reserved */
    uint64_t resv1 : 1;
    uint64_t resv2 : 61;
} __attribute__((packed, aligned(8))) dmac_ch_intclear_t;

typedef union _dmac_ch_intclear_u
{
    uint64_t data;
    dmac_ch_intclear_t intclear;
} dmac_ch_intclear_u_t;

typedef struct _dmac_channel
{
    /* (0x100) SAR Address Register */
    uint64_t sar;
    /* (0x108) DAR Address Register */
    uint64_t dar;
    /* (0x110) Block Transfer Size Register */
    uint64_t block_ts;
    /* (0x118) Control Register */
    uint64_t ctl;
    /* (0x120) Configure Register */
    uint64_t cfg;
    /* (0x128) Linked List Pointer register */
    uint64_t llp;
    /* (0x130) Channelx Status Register */
    uint64_t status;
    /* (0x138) Channelx Software handshake Source Register */
    uint64_t swhssrc;
    /* (0x140) Channelx Software handshake Destination Register */
    uint64_t swhsdst;
    /* (0x148) Channelx Block Transfer Resume Request Register */
    uint64_t blk_tfr;
    /* (0x150) Channelx AXI ID Register */
    uint64_t axi_id;
    /* (0x158) Channelx AXI QOS Register */
    uint64_t axi_qos;
    /* Reserved address */
    uint64_t reserved1[4];
    /* (0x180) Interrupt Status Enable Register */
    uint64_t intstatus_en;
    /* (0x188) Channelx Interrupt Status Register */
    uint64_t intstatus;
    /* (0x190) Interrupt  Siganl Enable Register */
    uint64_t intsignal_en;
    /* (0x198) Interrupt Clear Register */
    uint64_t intclear;
    uint64_t reserved2[12];
} __attribute__((packed, aligned(8))) dmac_channel_t;

typedef struct _dmac
{
    /* (0x00) DMAC ID Rgister */
    uint64_t id;
    /* (0x08) DMAC COMPVER Register */
    uint64_t compver;
    /* (0x10) DMAC Configure Register */
    uint64_t cfg;
    /* (0x18) Channel Enable Register */
    uint64_t chen;
    uint64_t reserved1[2];
    /* (0x30) DMAC Interrupt Status Register */
    uint64_t intstatus;
    /* (0x38) DMAC Common register Interrupt Status Register */
    uint64_t com_intclear;
    /* (0x40) DMAC Common Interrupt Enable Register */
    uint64_t com_intstatus_en;
    /* (0x48) DMAC Common Interrupt Signal Enable Register */
    uint64_t com_intsignal_en;
    /* (0x50) DMAC Common Interrupt Status */
    uint64_t com_intstatus;
    /* (0x58) DMAC Reset register */
    uint64_t reset;
    uint64_t reserved2[20];
    dmac_channel_t channel[DMAC_CHANNEL_COUNT];
} __attribute__((packed, aligned(8))) dmac_t;

typedef struct _dmac_channel_config
{
    uint64_t sar;
    uint64_t dar;
    uint8_t ctl_sms;
    uint8_t ctl_dms;
    uint8_t ctl_src_msize;
    uint8_t ctl_drc_msize;
    uint8_t ctl_sinc;
    uint8_t ctl_dinc;
    uint8_t ctl_src_tr_width;
    uint8_t ctl_dst_tr_width;
    uint8_t ctl_ioc_blktfr;
    uint8_t ctl_src_stat_en;
    uint8_t ctl_dst_stat_en;
    uint8_t cfg_dst_per;
    uint8_t cfg_src_per;
    uint8_t cfg_src_hs_pol;
    uint8_t cfg_dst_hs_pol;
    uint8_t cfg_hs_sel_src;
    uint8_t cfg_hs_sel_dst;
    uint64_t cfg_src_multblk_type;
    uint64_t cfg_dst_multblk_type;
    uint64_t llp_loc;
    uint8_t llp_lms;
    uint64_t ctl_block_ts;
    uint8_t ctl_tt_fc;
    uint8_t cfg_protctl;
    uint8_t cfg_fifo_mode;
    uint8_t cfg_fcmode;
    uint8_t cfg_lock_ch_l;
    uint8_t cfg_ch_prior;
} dmac_channel_config_t;

#define LIST_ENTRY(ptr, type, member) \
    ((type *)((char *)(ptr) - (unsigned long)(&((type *)0)->member)))

struct list_head_t
{
    struct list_head_t *next, *prev;
};

/**
 * @brief       Dmac.data/dw_dmac_lli_item
 *
 * @desc        This structure is used when creating Linked List Items.
 *
 * @see         dw_dmac_addLliItem()
 */
typedef struct _dmac_lli_item
{
    uint64_t sar;
    uint64_t dar;
    uint64_t ch_block_ts;
    uint64_t llp;
    uint64_t ctl;
    uint64_t sstat;
    uint64_t dstat;
    uint64_t resv;
} __attribute__((packed, aligned(64))) dmac_lli_item_t;

extern volatile dmac_t *const dmac;

/**
 * @brief       Dmac initialize
 */
void dmac_init(void);

/**
 * @brief       Set dmac param
 *
 * @param[in]   channel_num             Dmac channel
 * @param[in]   src                     Dmac source
 * @param[in]   dest                    Dmac dest
 * @param[in]   src_inc                 Source address increase or not
 * @param[in]   dest_inc                Dest address increase or not
 * @param[in]   dmac_burst_size         Dmac burst length
 * @param[in]   dmac_trans_width        Dmac transfer data width
 * @param[in]   block_size               Dmac transfer length
 *
 */
void dmac_set_single_mode(dmac_channel_number_t channel_num,
                          const void *src, void *dest, dmac_address_increment_t src_inc,
                          dmac_address_increment_t dest_inc,
                          dmac_burst_trans_length_t dmac_burst_size,
                          dmac_transfer_width_t dmac_trans_width,
                          size_t block_size);

/**
 * @brief       Determine the transfer is complete or not
 *
 * @param[in]   channel_num             Dmac channel
 *
 * @return      result
 *     - 0      uncompleted
 *     - 1  completed
*/
int dmac_is_done(dmac_channel_number_t channel_num);

/**
 * @brief       Wait for dmac work done
 *
 * @param[in]   channel_num  Dmac channel
 *
 */
void dmac_wait_done(dmac_channel_number_t channel_num);

/**
 * @brief       Determine the dma is idle or not
 *
 * @param[in]   channel_num             Dmac channel
 *
 * @return      result
 *     - 0      busy
 *     - 1      idel
*/
int dmac_is_idle(dmac_channel_number_t channel_num);

/**
 * @brief       Wait for dmac idle
 *
 * @param[in]   channel_num  Dmac channel
 *
 */
void dmac_wait_idle(dmac_channel_number_t channel_num);

/**
 * @brief       Set interrupt param
 *
 * @param[in]   channel_num             Dmac channel
 * @param[in]   dmac_callback           Dmac interrupt callback
 * @param[in]   ctx                     The param of callback
 * @param[in]   priority                Interrupt priority
 */
void dmac_irq_register(dmac_channel_number_t channel_num, plic_irq_callback_t dmac_callback, void *ctx, uint32_t priority);

/**
 * @brief       Unregister dmac interrupt
 *
 * @param[in]   channel_num             Dmac channel
 *
 */
void dmac_irq_unregister(dmac_channel_number_t channel_num);

/**
 * @brief       Set source dest and length
 *
 * @param[in]   channel_num             Dmac channel
 * @param[in]   src                     Source
 * @param[in]   dest                    Dest
 * @param[in]   len                     The length of dmac transfer
 */
void dmac_set_src_dest_length(dmac_channel_number_t channel_num, const void *src, void *dest, size_t len);

/**
 * @brief       Disable dmac channel interrupt
 *
 * @param[in]   channel_num             Dmac channel
 *
*/
void dmac_disable_channel_interrupt(dmac_channel_number_t channel_num);

/**
 * @brief       Disable dmac channel
 *
 * @param[in]   channel_num             Dmac channel
 *
*/
void dmac_channel_disable(dmac_channel_number_t channel_num);

/**
 * @brief       Enable dmac channel
 *
 * @param[in]   channel_num             Dmac channel
 *
*/
void dmac_channel_enable(dmac_channel_number_t channel_num);

#ifdef __cplusplus
}
#endif

#endif /* _DRIVER_DMAC_H */
